src/DataProcessors/ОбменСообщениями100СП/ОбменСообщениями100СП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОбменСообщениями100СП</name>
</mdclass:DataProcessor>

src/InformationRegisters/Чат100СП_Диалоги/Чат100СП_Диалоги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Чат100СП_Диалоги</name>
  <resources>
    <name>subject</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>connected_type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>connected_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>last_message</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Покупка</name>
    <type>
      <types>CatalogRef.Покупки</types>
      <types>CatalogRef.Заказы</types>
    </type>
  </resources>
  <dimensions>
    <name>mdid</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>user</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>opponent</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>unread</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>updated</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/DataProcessors/ОбменСообщениями100СП/Forms/Форма_СписокДиалогов/Module.bsl
&НаСервере
Процедура ПолучитьДиалогиНаСервере()
	//об=ДанныеФормыВЗначение(Объект,Тип("ОбработкаОбъект.ЧатСП"));
	Попытка
		//Для  инд =1 по 100 Цикл
		//	СтоСПОбмен_Сообщения.ПолучитьСписокДиалогов(истина,инд);
		//КонецЦикла;			
		СтоСПОбмен_Сообщения.ПолучитьСписокДиалогов();
	Исключение
	КонецПопытки;

	Попытка
		СтоСПОбмен_Сообщения.ПолучитьСписокДиалогов(Истина);
		//Для  инд =1 по 100 Цикл
		//	СтоСПОбмен_Сообщения.ПолучитьСписокДиалогов(ложь,инд);
		//КонецЦикла;	
	Исключение
	КонецПопытки;
	Элементы.Диалоги.Обновить();
	

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДиалоги(Команда)
	ПолучитьДиалогиНаСервере();
КонецПроцедуры



&НаКлиенте
Процедура НовыйДиалог(Команда)
	Оповещение = Новый ОписаниеОповещения("НовыйДиалог_Завершение",ЭтотОбъект);
	ОткрытьФорму("Обработка.ОбменСообщениями100СП.Форма.Форма_Диалог",Новый Структура("Оппонент",Участник),ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	//фрм=ПолучитьФорму("Обработка.ОбменСообщениями100СП.Форма.Форма_Диалог",Новый Структура("Оппонент",Участник),ЭтаФорма);
	//фрм.Открыть();   //Элементы.Диалоги
	//НовыйДиалогНаСервере();
КонецПроцедуры

Процедура НовыйДиалог_Завершение(Параметры,ПрочиеПараметры) Экспорт
	ПолучитьДиалогиНаСервере();	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ТипЗнч(ВыбранноеЗначение)=Тип("РегистрСведенийКлючЗаписи.Чат100СП_Диалоги") Тогда
		
		ОткрытьФорму("РегистрСведений.Чат100СП_Диалоги.ФормаЗаписи",новый Структура("Ключ",ВыбранноеЗначение),ЭтаФорма);	
	ИначеЕсли ТипЗнч(ВыбранноеЗначение)=Тип("РегистрСведенийКлючЗаписи.Чат100СП_Сообщения") Тогда	
		 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПолучитьДиалогиНаСервере();
	//ПолеОтбора = Диалоги.КомпоновщикНастроек.Настройки.Отбор.Элементы[0];
	//ПолеОтбора.ЛевоеЗначение = ПолеОтбора;
	//ПолеОтбора.Использование = Истина;
	//ПолеОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ПолеОтбора.ПравоеЗначение = Справочники.Участники.ПустаяСсылка();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если  ТипЗнч(Параметры.Оппонент) = Тип("СправочникСсылка.Коробки") Тогда
		//ПолеОтбора = Диалоги.Отбор.Элементы[0];
		//ПолеОтбора.ЛевоеЗначение = ПолеОтбора;
		//ПолеОтбора.Использование = Истина;
		//ПолеОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		//ПолеОтбора.ПравоеЗначение = Параметры.Оппонент.Организатор.Участник;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура УчастникПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Участник) Тогда
		элементОтбора = Диалоги.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
		элементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("opponent"); 
		элементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
		элементОтбора.Использование 	= Истина;
		элементОтбора.ПравоеЗначение 	= Участник;
	Иначе
		Диалоги.Отбор.Элементы.Очистить();
	КонецЕсли;
КонецПроцедуры


Процедура УстановитьОтборПоУчастнику()
	элементОтбора = Диалоги.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
	элементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("opponent"); 
	элементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	элементОтбора.Использование 	= Истина;
	элементОтбора.ПравоеЗначение 	= Участник;
КонецПроцедуры
